<?php
function get_calc_pdf()
{
    $calc_list = json_decode( stripslashes($_POST['calc_list']) );
    $calc_total_results = json_decode( stripslashes($_POST['calc_total_results']) );
    $glue_amount = $_POST['glue_amount'];



  



    // header('Content-Type: application/pdf');

    // print_r($calc_list);

    // включаем буфер
    ob_start();
    
    // выводим информацию
    ?>
    
    <!DOCTYPE html>
    <html lang="en">
    <head>
      <meta charset="UTF-8">
      <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <title>Stonelight Calculator Results</title>
    </head>

      <body>

        <div class="calc-pdf-result">
        

            <header class="calc-pdf-result__header">
              <div class="container">
                <div class="logo">
                  <svg width="62" height="51" viewBox="0 0 62 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M28.1084 43.0048C27.1067 43.0131 26.144 43.3939 25.4079 44.0731C24.6719 44.7522 24.2152 45.681 24.1269 46.6784C24.091 47.1534 24.1548 47.6307 24.3142 48.0796C24.4737 48.5285 24.7254 48.9391 25.053 49.285C25.3806 49.631 25.777 49.9046 26.2167 50.0883C26.6564 50.2721 27.1296 50.3619 27.6061 50.352C28.6082 50.3451 29.5716 49.9647 30.308 49.2853C31.0444 48.6059 31.5006 47.6763 31.5875 46.6784C31.6245 46.2032 31.5613 45.7255 31.4022 45.2762C31.2431 44.8269 30.9915 44.4159 30.6637 44.0697C30.3358 43.7236 29.9391 43.45 29.4989 43.2665C29.0588 43.0831 28.5851 42.9939 28.1084 43.0048ZM31.0363 46.6784C30.9525 47.5358 30.5522 48.3313 29.9135 48.9098C29.2748 49.4882 28.4435 49.8081 27.5816 49.8071C27.1768 49.8128 26.7751 49.7347 26.4019 49.5777C26.0288 49.4207 25.6921 49.1882 25.4132 48.8948C24.9157 48.3618 24.6417 47.6584 24.6476 46.9294C24.6476 46.8621 24.6476 46.7886 24.6476 46.7213C24.725 45.8624 25.1188 45.063 25.7527 44.4781C26.3865 43.8932 27.2151 43.5645 28.0777 43.5558C28.4842 43.5493 28.8875 43.6276 29.2619 43.7857C29.6363 43.9439 29.9736 44.1784 30.2522 44.4742C30.5273 44.7618 30.7392 45.1038 30.8742 45.4781C31.0092 45.8524 31.0644 46.2509 31.0363 46.6478V46.6784Z" fill="#80BA27"/>
                    <path d="M22.9022 25.152C22.9022 25.152 18.9514 1.50618 18.8166 0.661249L46.1476 5.51041L37.4191 25.103H38.0316L46.9439 5.11244L18.1367 0L22.3632 25.152H22.9022Z" fill="#80BA27"/>
                    <path d="M31.1211 39.3073L30.5086 40.6665H25.5226C25.5226 40.4583 24.2976 33.252 24.2976 33.252L23.9668 34.7459L25.0448 41.2176H30.8639L31.7827 39.142L31.1211 39.3073Z" fill="#80BA27"/>
                    <path d="M30.0936 25.5923C30.3404 25.6361 30.5947 25.6032 30.8222 25.498C31.0497 25.3928 31.2394 25.2204 31.3658 25.004C31.4922 24.7876 31.5491 24.5377 31.5289 24.2879C31.5087 24.0382 31.4123 23.8006 31.2528 23.6074C31.0933 23.4141 30.8783 23.2744 30.6368 23.2071C30.3954 23.1398 30.1391 23.1482 29.9025 23.2311C29.666 23.314 29.4605 23.4674 29.314 23.6707C29.1674 23.8739 29.0868 24.1172 29.0829 24.3678C29.0556 24.6639 29.1465 24.9588 29.3358 25.1882C29.5251 25.4176 29.7975 25.5629 30.0936 25.5923Z" fill="#80BA27"/>
                    <path d="M34.2022 22.0966L32.7076 21.6558C31.9554 23.4334 31.3251 25.2601 30.8211 27.1233C30.0186 27.6131 28.8671 27.5336 28.5425 27.0192C28.5394 26.9642 28.5394 26.909 28.5425 26.8539C28.5425 24.8579 28.3893 22.8864 28.4199 20.8904C27.5134 20.8904 27.2745 20.7129 26.7539 20.7129C26.6559 26.5417 26.6314 32.5541 26.9989 38.3768H28.959C28.7875 35.6032 28.7507 32.8052 28.6895 29.9887V29.8785H30.4413C30.4413 30.001 30.4413 30.1234 30.4413 30.2459C30.4955 33.0104 30.88 35.7586 31.5867 38.4319L33.4733 37.9605C32.1012 32.1501 31.8011 28.1642 34.2022 22.0966Z" fill="#80BA27"/>
                    <path d="M37.7744 6.80165L27.3614 4.96484L23.625 12.7529L24.9174 20.4552L35.3304 22.292L39.0668 14.504L37.7744 6.80165ZM35.3243 21.5512C35.3243 21.4532 35.2753 21.2573 35.2324 20.994L36.9291 17.4735L38.6074 13.9346C38.6074 14.0754 38.6503 14.1917 38.6626 14.2774L37.2415 17.4796C36.433 19.2062 35.5448 21.1103 35.312 21.5512H35.3243ZM37.8173 9.01806L36.1206 12.6243L34.4177 16.2244C34.3749 15.9734 34.3381 15.7408 34.3014 15.5326L36.0287 12.2447L37.7805 8.8956C37.7867 8.91397 37.7928 8.96295 37.805 9.01806H37.8173ZM37.9643 9.8936L36.2737 13.5243L34.5709 17.1428C34.5341 16.8979 34.4913 16.6592 34.4545 16.4326L36.1573 13.0896L37.8969 9.70992C37.9275 9.79564 37.9398 9.83237 37.952 9.8936H37.9643ZM38.1113 10.7691L36.4268 14.4427L34.7424 18.1164C34.6995 17.8776 34.6566 17.6327 34.6199 17.3939L36.3411 14.008L38.0745 10.6038L38.1113 10.7691ZM38.2461 11.6324L36.5677 15.306L34.8833 18.9797C34.8404 18.7347 34.8036 18.4898 34.7608 18.2388L36.4758 14.8162L38.2032 11.3753C38.2154 11.4794 38.2338 11.5651 38.2461 11.6324ZM38.3931 12.508L36.727 16.1816L35.0364 19.9042C34.9996 19.6654 34.9568 19.4144 34.9139 19.1511L36.6228 15.6918L38.3441 12.2447C38.3624 12.3427 38.3747 12.4345 38.3931 12.5264V12.508ZM38.5401 13.3835L36.8801 17.0877L35.1957 20.8409C35.1589 20.6144 35.1099 20.3511 35.067 20.0634L36.7699 16.5979L38.4788 13.0958C38.5033 13.2019 38.5237 13.3039 38.5401 13.4019V13.3835ZM37.658 8.14251L35.9552 11.7304L34.2585 15.306C34.1972 14.9081 34.1482 14.6509 34.1421 14.6142L35.8817 11.3508L37.6396 8.03231L37.658 8.14251ZM27.5819 5.35057L37.3824 7.07105L33.8726 14.3815L24.0721 12.6549L27.5819 5.35057Z" fill="#80BA27"/>
                    <path d="M40.4454 35.1311H38.6078V27.6553H37.4318V28.2676C37.4036 29.5923 37.3054 30.9146 37.1377 32.229C37.0593 33.1102 36.6885 33.9398 36.0842 34.5862C35.5998 34.9632 35.0014 35.1641 34.3875 35.1556H33.9648V33.5821H34.1854C34.3745 33.5695 34.5582 33.5131 34.7219 33.4175C34.8855 33.3219 35.0248 33.1896 35.1286 33.031C35.3492 32.7188 35.4594 32.2045 35.5697 30.8208C35.6248 30.2085 35.6983 28.335 35.7167 27.8023L35.7534 25.9961H40.4454V35.1311Z" fill="#80BA27"/>
                    <path d="M45.7661 32.4515C45.7864 32.5985 45.7747 32.748 45.7318 32.89C45.6889 33.032 45.6158 33.163 45.5174 33.2741C45.4191 33.3852 45.2979 33.4737 45.1622 33.5336C45.0264 33.5934 44.8793 33.6233 44.7309 33.621C44.5813 33.6255 44.4334 33.5884 44.3036 33.5138C44.1738 33.4392 44.0673 33.33 43.9959 33.1985C43.8656 32.9718 43.8019 32.7129 43.8121 32.4515C43.7944 32.1027 43.9032 31.7593 44.1184 31.4842C44.252 31.3477 44.414 31.2424 44.5929 31.1758C44.7718 31.1091 44.9633 31.0827 45.1536 31.0984C45.3589 31.1009 45.5637 31.1194 45.7661 31.1535V32.4515ZM45.7661 35.1394H47.6037V28.7412C47.6289 28.3493 47.5746 27.9564 47.444 27.5861C47.3135 27.2157 47.1095 26.8756 46.8442 26.586C46.3089 26.0954 45.6039 25.832 44.8779 25.8513C44.1183 25.8256 43.3782 26.0956 42.8137 26.6044C42.5628 26.8663 42.3664 27.1755 42.236 27.5139C42.1056 27.8524 42.0438 28.2134 42.0542 28.5759H43.8121C43.8208 28.3508 43.9049 28.1351 44.051 27.9636C44.1424 27.8572 44.2563 27.7723 44.3845 27.7151C44.5126 27.658 44.6519 27.6299 44.7922 27.633C44.9283 27.6289 45.0638 27.6529 45.1903 27.7035C45.3168 27.7541 45.4314 27.8301 45.5272 27.9269C45.6162 28.0333 45.6831 28.1562 45.7241 28.2887C45.7651 28.4211 45.7794 28.5603 45.7661 28.6983V29.6535C45.4218 29.6261 45.0763 29.6158 44.7309 29.6229C44.3329 29.5952 43.9334 29.6517 43.5587 29.7889C43.184 29.926 42.8425 30.1407 42.5565 30.4188C42.116 31.0948 41.9153 31.899 41.9868 32.7026C41.9493 33.0791 41.9885 33.4594 42.1022 33.8204C42.2159 34.1813 42.4017 34.5155 42.6483 34.8026C43.0392 35.1325 43.54 35.303 44.051 35.2802C44.4387 35.2967 44.8194 35.1728 45.123 34.9312C45.3614 34.731 45.568 34.4957 45.7355 34.2332H45.7722L45.7661 35.1394Z" fill="#80BA27"/>
                    <path d="M54.3603 22.5864C54.381 22.8771 54.3429 23.169 54.2481 23.4447C54.1534 23.7203 54.0041 23.974 53.809 24.1906C53.5121 24.5202 53.119 24.7481 52.6853 24.8419C52.2516 24.9357 51.7994 24.8906 51.3927 24.7132C50.9861 24.5357 50.6457 24.2347 50.4197 23.853C50.1937 23.4713 50.0937 23.0282 50.1338 22.5864V22.3477H51.4998V22.6538C51.5047 22.7913 51.5295 22.9274 51.5733 23.0579C51.6254 23.1855 51.719 23.2918 51.8391 23.3595C51.9591 23.4273 52.0986 23.4526 52.2348 23.4314C52.3713 23.4478 52.5095 23.4205 52.6295 23.3534C52.7495 23.2862 52.8451 23.1828 52.9024 23.0579C52.9546 22.9287 52.9876 22.7925 53.0005 22.6538V22.3477H54.3603V22.5864ZM51.1384 25.9968V31.097L53.4047 27.1172V25.9968H55.2423V35.1318H53.4047V30.0316L51.1384 34.0052V35.1318H49.3008V25.9968H51.1384Z" fill="#80BA27"/>
                    <path d="M60.1634 27.6553V35.1311H58.3259V27.6553H56.4883V25.9961H62.001V27.6553H60.1634Z" fill="#80BA27"/>
                    <path d="M4.36077 25.0587C4.36334 24.7573 4.27821 24.4616 4.11576 24.2077C4.00765 24.0554 3.86282 23.9329 3.6947 23.8516C3.52658 23.7702 3.34062 23.7327 3.15409 23.7424C2.97146 23.7362 2.78977 23.7709 2.62231 23.844C2.45485 23.9171 2.30587 24.0267 2.18629 24.1648C1.93249 24.5408 1.81571 24.9926 1.85553 25.4445V31.8365C1.80955 32.2359 1.8933 32.6395 2.09441 32.9876C2.20597 33.1422 2.35497 33.266 2.52745 33.3474C2.69992 33.4288 2.89024 33.4651 3.08058 33.4529C3.27521 33.4622 3.46942 33.4274 3.64868 33.351C3.82794 33.2747 3.98761 33.1588 4.11576 33.0121C4.3146 32.6962 4.40692 32.325 4.37914 31.9529V31.4937H6.21673V32.0263C6.27194 32.8886 5.99343 33.7392 5.43882 34.4019C5.11501 34.7116 4.72925 34.9492 4.30694 35.099C3.88463 35.2489 3.43536 35.3076 2.9887 35.2714C2.55255 35.2917 2.11741 35.2137 1.71554 35.043C1.31367 34.8724 0.95538 34.6135 0.667221 34.2856C0.162923 33.6183 -0.0691388 32.7846 0.0179412 31.9529V25.2179C-0.0264969 24.7502 0.0358643 24.2785 0.200324 23.8383C0.364785 23.3982 0.627052 23.0011 0.96736 22.677C1.56092 22.1848 2.30938 21.9181 3.08058 21.9239C3.9038 21.9226 4.69986 22.2182 5.32244 22.7566C5.86661 23.3406 6.16113 24.1139 6.14322 24.9118V25.7996H4.36077V25.0587Z" fill="#80BA27"/>
                    <path d="M10.431 27.5518V35.0888H8.59344V27.5518H6.75586V25.8926H12.3176V27.5518H10.431Z" fill="#80BA27"/>
                    <path d="M16.6604 32.2351C16.6824 32.5663 16.5846 32.8944 16.3847 33.1596C16.2021 33.3257 15.964 33.4177 15.7171 33.4177C15.4702 33.4177 15.2321 33.3257 15.0494 33.1596C14.8496 32.8944 14.7517 32.5663 14.7738 32.2351V28.7757C14.7517 28.4445 14.8496 28.1164 15.0494 27.8512C15.2321 27.6852 15.4702 27.5931 15.7171 27.5931C15.964 27.5931 16.2021 27.6852 16.3847 27.8512C16.5846 28.1164 16.6824 28.4445 16.6604 28.7757V32.2351ZM12.9178 32.1187C12.875 32.5688 12.9342 33.0228 13.0912 33.4468C13.2481 33.8708 13.4988 34.254 13.8244 34.5678C14.3641 34.9919 15.0306 35.2224 15.7171 35.2224C16.4036 35.2224 17.0701 34.9919 17.6098 34.5678C17.9354 34.254 18.186 33.8708 18.343 33.4468C18.4999 33.0228 18.5592 32.5688 18.5163 32.1187V28.8615C18.5588 28.4114 18.4993 27.9576 18.3424 27.5336C18.1854 27.1097 17.9351 26.7265 17.6098 26.4124C17.0701 25.9883 16.4036 25.7578 15.7171 25.7578C15.0306 25.7578 14.3641 25.9883 13.8244 26.4124C13.4991 26.7265 13.2487 27.1097 13.0918 27.5336C12.9349 27.9576 12.8754 28.4114 12.9178 28.8615V32.1187Z" fill="#80BA27"/>
                    <path d="M20.8995 25.8926L22.4001 31.605H22.4737L23.6252 25.8926H25.4628L22.9575 36.3317C22.8575 37.052 22.5632 37.7314 22.1061 38.2971C21.8528 38.5092 21.56 38.6692 21.2447 38.7679C20.9294 38.8667 20.5977 38.9023 20.2685 38.8727H19.7847L19.7479 37.1461H20.1032C20.2681 37.1544 20.4325 37.1212 20.5812 37.0495C20.73 36.9779 20.8584 36.87 20.9546 36.7358C21.1237 36.4647 21.2382 36.1631 21.2915 35.8481L21.5855 34.6235L18.8965 25.8926H20.8995Z" fill="#80BA27"/>
                  </svg>

                </div>
                <div class='calc-pdf-result__header__desc'>Наведені нижче розрахунки є приблизними та потребують уточнення в нашого менеджера</div>
              </div>
           
            </header>

            <div class="calc-pdf-result__body">
              <div class="container">
                <div class="calc-pdf-result__title">
                  <h1>Сумарні розрахунки</h1>
                </div>
              
                <div class="calc-pdf-result__col--wrap">
                  
                  
                    <div class="calc-pdf-result__col calc-pdf-result__col--left">
                      <div class="calc-pdf-result-list">


                        <?php
                        $calc_item_index = 0;
                        foreach ($calc_list as $calc_item) :

                          $calc_item_index++;



                          if ($calc_item->checked && $calc_item_index !== 5):
                          ?>
                          <div class="calc-pdf-result-list-item">
                          
                            <h2 class="calc-pdf-result-list-item__title add-text"><?= $calc_item->title ?></h2>
                            <div class="floors">

                              <?php 
                              $floor_index = 0;
                              $block_thickness = (float)$calc_item->calcItemSettings->blockThicknessM->value * 1000;
                              // print_r($calc_item->calcItemSettings->blockThicknessM->value);

                              foreach ($calc_item->calcItemData as $floor):
                                
                                $floor_index++;
                                $floor_val = 0;
                                $floor_height = $floor->height->value;

                                ?>
                              
                              <div class="floor">
                                <?php if ($calc_item_index !== 2): ?>
                                <div class="floor__title bold-title">Поверх <?= $floor_index ?></div>
                                <?php endif; ?>

                                <table class="floor-params">
                                  <?php 
                            

                                  $floor_walls_length = 0;
                                  foreach ($floor->walls as $wall):
                                    // print_r($wall);
                                    $floor_walls_length += (float)$wall->wallLength->value;
                                  endforeach; 
                                  // echo  $floor_walls_length;
                                  $floor_block_volume = $floor_walls_length * $floor_height;
                                  ?>
                                  <tr>
                                    <th>
                                      <table class="floor-params__el">
                                        <tr>
                                          <th class='floor-params__name'>Товщина блоку, мм:</th>
                                          <th class='floor-params__val'><?= $block_thickness ?></th>
                                        </tr>

                                      </table>
                                    </th>
                                    <th>
                                      <table class="floor-params__el">
                                        <tr>
                                          <th class='floor-params__name'>Об’єм блоку, м³:</th>
                                          <th class='floor-params__val'><?= $floor_block_volume?></th>
                                        </tr>

                                      </table>                                    
                                    </th>

                                  </tr>

                                

                                </table>
                              </div>

                              <?php endforeach; ?>

                            </div>

                            <div class="calc-pdf-result-list-item__total">
                              <span class='bold-title'>Загальний об'єм:</span>
                              <span class="calc-pdf-result-list-item__total__val" ><?= $calc_item->calcResults->blockVolume ?></span>
                            </div>

                          </div>
                          <?php 
                          endif;
                        endforeach; ?>





                      </div>
                    </div>

                    <div class="calc-pdf-result__col calc-pdf-result__col--right">
                      <table class="calc-pdf-result-all">

                        <tr class="calc-pdf-result-all__item">
                          <th class="bold-title calc-pdf-result-all__item__label"><?= $calc_total_results->totalBlocksVolume->label ?></th>
                          <th class='calc-pdf-result-all__item__val'><?= $calc_total_results->totalBlocksVolume->value ?></th>
                        </tr>


                        <?php 
                          $i = 1;
                          foreach ($calc_total_results->totalFloorsVolume as $floorVolume): ?>
                          <tr class="calc-pdf-result-all__item">
                            <th class="bold-title calc-pdf-result-all__item__label">Загальний об’єм <?= $i ?> поверху, м³:</th>
                            <th class='calc-pdf-result-all__item__val'><?= $floorVolume ?></th>
                          </tr>
                        <?php $i++; endforeach; ?>

                        <tr class="calc-pdf-result-all__item">
                          <th class="bold-title calc-pdf-result-all__item__label"><?= $calc_total_results->totalMansardFloorVolume->label ?></th>
                          <th class='calc-pdf-result-all__item__val'><?= $calc_total_results->totalMansardFloorVolume->value ?></th>
                        </tr>

                        <tr class="calc-pdf-result-all__item">
                          <th class="bold-title calc-pdf-result-all__item__label">Кількість U-Блоків,  шт.</th>
                          <th class='calc-pdf-result-all__item__val'><?= $calc_total_results->totalUBlocksAmount ?></th>
                        </tr>

                        <tr class="calc-pdf-result-all__item">
                          <th class="bold-title calc-pdf-result-all__item__label"><?= $calc_total_results->glueAmount->label ?></th>
                          <th class='calc-pdf-result-all__item__val'><?= $calc_total_results->glueAmount->value ?></th>
                        </tr>
                      
                      </table>

                      <div class="calc-pdf-result-table">
                        <span class="add-text calc-pdf-result-list-item__title">номенклатура та об’єм замовлення:</span>

                        <table>
                          <thead >
                            <tr class='calc-pdf-result-table__head'>
                              <th>Товщина блоку, мм</th>
                              <th>Об’єм блоку*, м³</th>
                            </tr>
                          </thead>
                          <tbody>
                            <?php 
                              $i = 1;
                              foreach ($calc_list as $calc_item):
                                if ($i !== 5 && $calc_item->checked):
                              ?>
                              <tr>
                                <th><?= $calc_item->calcResults->blockThicknessMM ?></th>
                                <th><?= $calc_item->calcResults->blockVolume ?></th>
                              </tr>
                            <?php 
                                endif;
                              $i++; endforeach;?>
                            
                          </tbody>
                        </table>
                      </div>
                    </div>

                  

                </div>
              </div>
            </div>
            
        

          <ul class="calc-pdf-result-contacts">
            <li><a href="#" class='calc-pdf-result-contacts__item'>+38 044 390 29 81 </a></li>
            <li><a href="#" class='calc-pdf-result-contacts__item'>office@budelement.com </a></li>
          </ul>

        </div>


      </body>
    </html>

    <?php
    
    // сохраняем всё что есть в буфере в переменную $content
    $html_markup = ob_get_contents();

    ob_end_clean();

    $date = date('Y-m-d-H-i-s');

    $stylesheet = file_get_contents('../wp-content/themes/stonelight/build/static/css/pages/page-calc-pdf-result.css');
    
    header('Content-Type: application/pdf');

    $mpdf = new \Mpdf\Mpdf();
    // $mpdf->debug = true;

    $mpdf->WriteHTML($stylesheet, \Mpdf\HTMLParserMode::HEADER_CSS);
    
    $mpdf->WriteHTML( $html_markup );

    # get stylesheet file and put it in variable 
   

   

  
    $file_name = '/wp-content/uploads/stonelight-calc-results/stonelight_calc_results-'.$date.'.pdf';

    // the place where 
    $mpdf->Output('..' . $file_name, 'F'); 

    echo $file_name;
    
   die();
}

add_action('wp_ajax_get_calc_pdf', 'get_calc_pdf');
add_action('wp_ajax_nopriv_get_calc_pdf', 'get_calc_pdf');